{
    "comments": [],
    "tags": ["html", "javascript", "technology", "web-dev"],
    "title": "A JavaScript Phone: Microsoft's Night Terrors",
    "html": "<p>Today Mozilla announced their proposal for providing phone-like\nfunctionality to the browser in <a target=\"_blank\" href=\"http://hacks.mozilla.org/2011/08/introducing-webapi/\">this\nhacks.mozilla.org article</a>. Their goal is to provide \"basic\nHTML5 phone experience within 3 to 6 months.\"</p>\n<p>Specifically, they want to provide JavaScript APIs for accessing\nthe phone dialer, address book, SMS, and more. We already have\nsupport on Android and iOS for getting geolocation data from GPS.\nThere is also some support for taking photos using only JavaScript.\nAnd don't forget the FileReader and FileWriter APIs.</p>\n<p>Really, accessing this type of phone functionality is only one\nstep away from now. Not two steps. Not a year. It is right around\nthe corner. Combine that potential with the fact that Firefox,\nChrome, and Safari are on release schedules measured in weeks, not\nthe years we saw in the early and mid 2000s.</p>\n<p>Take Firefox for example. Version 2 was released in October\n2006, version 3 in June 2008, version 4 in March 2011, version 5 in\nJune 2011, and version 6 this month--August 2011. That's right,\nthat fast. In 2011, Firefox moved to a 6-week release cycle.</p>\n<p>Chrome is probably even more agressive. In less than 3 years, it\nhas gone from version 1 to version 13--and versions 9-13 were\nreleased in 2011 alone!</p>\n<p>So 3 to 6 months suddenly seems like a long time in the world of\nbrowsers. It is very doable that we will very soon see phones\nopening up a new world of possibilities. Web apps doing the work of\nnative apps. The biggest mobile browsers--Chrome and Mobile\nSafari--are made by the OS makers themselves. So if they want to\nmove quickly they can.</p>\n<p>For years pundits have speculated that Microsoft Windows would\nsoon be obsolete. It is threatened by cloud computing like Gmail\nand Google Office apps and is now threatened by mobile apps.\nMicrosoft tried to break in the mobile game with Windows 7 Phone,\nbut haven't made any headway. In desparation, they have made a\npartnership with the handset manufacturer Nokia, but many feel that\nWindows Phone Software is doomed no matter how many people get\nstuck with it on their phone.</p>\n<p>What cards does Microsoft have left? JavaScript and Mobile\nBrowsers are rising so fast that soon no one will care about\noperating systems, only about browser capability. Microsoft is\npeeing its pants right about now. Windows will never go away, but\nit seems to matter less and less in the world today.</p>",
    "timestamp": 1314165600000,
    "slug": "a-javascript-phone-microsofts-night-terrors",
    "nid": 90
}