{
    "comments": [],
    "tags": [],
    "title": "HTTP Status Codes: 302, 303, and 307",
    "html": "<p>Browsers implement both 302 and 303 to mean to go to the new URL\nincluding the get query string. 307 instructs the browser to repost\nany post data to the new URL including the get query string. Here\nis what I found on Windows.</p>\n<p>IE properly and silently reposts as you would expect.</p>\n<h3>Firefox 2/3</h3>\n<p>Firefox asks the user to click OK to execute the repost or\nCANCEL to do nothing. Doing nothing might mean that the page loads\nup blank, which is kind of silly.</p>\n<h3>Opera 9.25</h3>\n<p>Opera is similar to Firefox but provides a third option. Opera\nprompts with YES to repost, NO to use get only, and CANCEL to do\nnothing.</p>\n<h3>Safari 3</h3>\n<p>Safari treats a 307 the same as a 303 and gives no option to\nrepost. Technical tests from the <a href=\"http://phaq.phunsites.net/2008/01/23/apples-safari-violates-rfc2616/\">\nphaq blog.</a></p>\n<h3>My solution</h3>\n<p>My solution was to use 307 for IE and use HTML and JavaScript\nfor the other browsers. I made a form full of hidden fields for\neach posted value and then submitted the form through JavaScript.\nTo users, the redirect looks as you would expect.</p>\n<p>The trick was that I could not use document.forms[0].submit()\nbecause sometimes one of the hidden elements is named submit. So I\nhad to use an additional button that was positioned with top:\n-100px; in the style attribute.</p>\n<p>For those with JavaScript disabled, I used noscript tags to\nenclose a notice that the page was moved and a button to go to the\nnew location.</p>\n<h3>Demos + Source</h3>\n<p><a href=\"http://kendsnyder.com/sandbox/307/fallback/\">Partial\nsolution which always does a 307 but falls back to JavaScript when\nuser cancels</a> (Does not work in Safari 3, does not work when\nuser chooses NO in Opera 9.25.)</p>\n<p><a href=\"http://kendsnyder.com/sandbox/307/javascript/\">Final\nsolution which does a 307 for IE but uses JavaScript for other\nbrowsers</a></p>\n<h3>Thoughts</h3>\n<p>I was surprised to see different behavior in every browser. I\ndon't see the advantage of the prompt other than a possible\nsecurity exploit. This is an instance where IE got it exactly to\nspec!</p>",
    "timestamp": 1218175200000,
    "slug": "http-status-codes-302-303-and-307",
    "nid": 22
}