{
    "comments": [],
    "tags": ["html", "php", "web-dev"],
    "title": "Wrangling MS Word's HTML",
    "html": "<p>For a taste of Word HTML, see the section following this\narticle. If you write HTML, a little part of you will die inside\nevery time you see MS Word HTML.</p>\n<p>One of the hard parts is extracting ordered and unordered lists.\nEspecially since that varies so much between browsers.</p>\n<p>For this PHP project, I needed to accept HTML from a WYSIWYG\neditor to save into a CMS system. The HTML needed to be quite\nrestricted; e.g. to disallow changing font faces and font colors.\nAnyway, here is the algorithm I ended up with:</p>\n<ol>\n<li>Find and replace common entities that seem to get mangled in a\nnormal DOMDocument conversion</li>\n<li>Remove comments</li>\n<li>Remove nested FONT tags since DOMDocument discards content\ninside nested FONT tags</li>\n<li>Extract ordered and unordered lists with regular\nexpressions</li>\n<li>Convert B and I tags to EM and STRONG and disallow any\nattributes in any of those</li>\n<li>Replace TABLE tags with a simple tag containing a css class and\ncellspacing of 0</li>\n<li>Load into DOMDocument</li>\n<li>Remove any tags not on the whitelist</li>\n<li>Remove any attributes not on the whitelist</li>\n<li>Disable href and src attributes that do not contain an http,\nhttps or relative link</li>\n<li>Strip out disallowed css styles from the style attribute</li>\n<li>Remove css classes that Word commonly uses</li>\n<li>Dump back to HTML</li>\n<li>Remove DOCTYPE, HTML and BODY tags that DOMDocument\nautomatically adds</li>\n<li>Use Tidy to clean up any additional problems, add P tags to\nplain text and remove duplicate white space</li>\n<li>Remove the linefeeds that Tidy leaves (we are sending content\nto Adobe Flex which parses HTML but interprets all white space\nliterally)</li>\n<li>Remove spans that have no attributes and thus no effect</li>\n<li>Remove empty paragraphs</li>\n</ol>\n<p>It feels good to get that worked out!</p>\n<br/>\n<a href=\"http://kendsnyder.com/archives/43-Wrangling-MS-Words-HTML.html#extended\">\nContinue reading \"Wrangling MS Word's HTML\"</a>",
    "timestamp": 1256623200000,
    "slug": "wrangling-ms-words-html",
    "nid": 50
}