{
    "comments": [],
    "tags": ["technology", "web-dev"],
    "title": "FOSS and Drug Dealing",
    "html": "<p>FOSS. Free and Open Source Software.</p>\n<p>Many argue against FOSS saying that Developers should get paid\nfor their work. First of all, \"Free\" does not mean zero dollars.\nAnd second of all, you are short sighted if you think selling code\nis the only way programmers are paid.</p>\n<p>Developers of zero-dollar software get the benefits of control,\nfreedom and experience which can outweigh any money they might\nmake. By control I mean the ability to exactly craft the feature\nset and API they wish. By freedom I mean freedom from paid\nlicensing and the whim of a software corporation. By experience, I\nmean that developers have a chance to contribute to a project which\nmay provide professional experience their day job cannot; and it is\noften a means for a developer to get name recognition.</p>\n<p>As far as business models, here are a few that work well with\nzero-dollar software:</p>\n<ul>\n<li>Earn community respect for your expertise then make money from\nspeaking at conferences</li>\n<li>Develop paid modules, features or add ons to the software</li>\n<li>Provide paid support for the software</li>\n</ul>\n<p>Paid software models also work and the FOSS would not shame\ndevelopers who sell their work. But developers of zero-dollar\nsoftware recognize that they can personally make far more money\nselling other services than they can make selling the software\nitself.</p>\n<p>Take for instance a no-name developer who wants to be the sole\ndeveloper for software that meets a certain need. He or she can\nrelease FOSS to a wide audience where the user base is large. The\nlarge user base provides opportunity for good feedback and help\nfrom others. Then the developer can use one of the business models\nabove.</p>\n<p>The developer may go another direction; he or she may charge for\nthe software. In this case of a no-name developer, it is hard to\nmake money. The developer has no name recognition and most users\nwill be unwilling to take a chance and pay for such software.</p>\n<p>The problem is a situation like the rumored Oracle decision:\nwhere a company takes zero-dollar Open Source Software and starts\ncharging money. It is like a drug dealer: get everyone addicted to\nthe free sample then drop down the price hammer.</p>\n<p>Wise up. It is short sighted and disingenuous to change a\nFOSS-based business model into a paid-software model.</p>",
    "timestamp": 1272175200000,
    "slug": "foss-and-drug-dealing",
    "nid": 57
}