{
    "comments": [{
        "timestamp": 1361257200000,
        "by": "Anonymous",
        "text": "You should check out pipette for color picking\nand cyberduck for ftp... and if you want a a good manager for\ndual/triple booting look into rEFIt for managing your os when you\nboot up. As for your window switching, just use command-tab that\nwill cycle through your open app windows. There are plenty of\nkeyboard replacements that you can use to re-map keys as well",
        "title": "You should check out pipette"
    }, {
        "timestamp": 1346479200000,
        "by": "Anonymous",
        "text": "thanks for the good list of addons. but\nseriously. you \"cant live without\" tools like apt-get and yum ...\nterminal.... yet still use windblows. it seems highly unlikely to\nabsurd.",
        "title": "good list but .. where have you been"
    }, {
        "timestamp": 1328684400000,
        "by": "Anonymous",
        "text": "<p>I think the Mac OSX terminal app is fine. The only problem is\nthe colors especially if you want a black background. There are\nways to fix it though. See: <a href=\"http://www.derekgourlay.com/archives/291\" title=\"http://www.derekgourlay.com/archives/291\">http://www.derekgourlay.com/archives/291</a>.</p>\n<p>I've always used DigitalColorMeter (Free) for picking out\ncolors.</p>\n<p>I have noticed that colors get washed out on other non-mac\nmonitors. I've been able to fix it by turning the brightness down\n~50%</p>\n<p>For home and end: I go into the keyboard prefs and switch the\ncontrol and capslock keys. Then you can type Control-a to go to the\nbeginning of a line, and Control-e to go to the end.</p>\n<p>Switching between windows of the same app: Command -\n`(back-tick).</p>\n<p>I've used this script for running IE7,8, and 9 with Virtual Box.\n<a href=\"http://osxdaily.com/2011/09/04/internet-explorer-for-mac-ie7-ie8-ie-9-free/\" title=\"http://osxdaily.com/2011/09/04/internet-explorer-for-mac-ie7-ie8-ie-9-free/\">\nhttp://osxdaily.com/2011/09/04/internet-explorer-for-mac-ie7-ie8-ie-9-free/</a></p>\n<p>I had a problem with the computer waking up from sleeping and it\nturned out that it had bad memory. I replaced it and everything was\nfine.</p>\n<p>I'm going to have to try thunderbird because Mail.app is not\nvery good.<br/>\n--Jon</p>",
        "title": "Terminal"
    }, {
        "timestamp": 1328770800000,
        "by": null,
        "text": "Thanks for the tip on Command + backtick! I\nhave considered Virtual Box, but gosh so much overhead to do one\nthing--test IE.",
        "title": "Re: Terminal"
    }],
    "tags": ["os-x", "web-dev"],
    "title": "I Switched from Windows 7 to OS X Lion",
    "html": "<p>I made the switch from Windows 7 to Mac OSX (Lion) for my\ndevelopment laptop. I got a new job and my boss asked me what kind\nof laptop I wanted to buy. I heard so many of my friends and\nbloggers talk about how OSX is the ultimate platform for Web\nDevelopers. I decided to take the plunge.</p>\n<p>I want to report on my progress. First I'll start with the\nsoftware I'm using.</p>\n<p><img src=\"/sites/all/themes/kds2/img/posts/osx/osx-windows.jpg\" width=\"620\" height=\"304\" alt=\"OSX and Windows 7\"/></p>\n<h2>Software I am using</h2>\n<p>Many of the free Windows programs I depend on do not have good\nequivalents on OSX. Or there are decent alternatives but they cost\nmoney. But the following are those I settled on</p>\n<style type=\"text/css\">\n.apps {\n  width: 500px;\n}\n.apps li, p {\n        clear: both;\n}\n.apps li {\n  margin-top: 16px;\n  text-align: justify;\n}\n.app-icon {\n        float: right;\n        margin: 0 0 15px 15px;\n}\n</style>\n<ul class=\"apps\">\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-homebrew.png\"/>\n<strong><a target=\"_blank\" href=\"http://mxcl.github.com/homebrew/\">OSX Homebrew</a> (Free)</strong>\nI can't live without OSX Homebrew. It is a package manager\nanalagous to yum or apt-get. It is so sweet to run commands such as\n`brew install node` and boom all the dependencies and files for\nNodeJS are downloaded and installed. Homebrew is a must!</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-netbeans.png\"/>\n<strong><a target=\"_blank\" href=\"http://netbeans.org/downloads/\">Netbeans for PHP</a>\n(Free).</strong> I'm absolutely hooked on Netbeans. In fact, if\nNetbeans did not have an OSX version, I wouldn't have considered\nswitching.</li>\n<li><strong>Netbeans SVN.</strong> Netbeans has a built-in SVN\nclient that works well with my workflow. I like to review every\nline change before I commit. It helps me catch debug code that I\nleft in and exclude partially done changes. I heavily relied on\nTortoise SVN for Windows and it has been a struggle to live without\nit. But Netbeans built-in SVN functionality is pretty dang good. I\nused WinMerge in conjunction with Tortoise, but it turns out that\nNetbeans has a good diff viewer built in.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-thunderbird.png\"/>\n<strong><a target=\"_blank\" href=\"http://www.mozilla.org/en-US/thunderbird/\">Thunderbird</a>\n(Free).</strong> I used Thunderbird on Windows over Outlook\nprimarily for its threading, searching, attachment handling, and\nmodal window behavior. I thought the built-in OSX Mail app would\nwork great, but it was too minimalistic. Thunderbird indeed works\ngreat on OSX.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-keypassx.png\"/>\n<strong><a target=\"_blank\" href=\"http://www.keepassx.org/downloads\">KeyPassX</a> (Free).</strong> I\nused KeyPass on Windows and KeyPassX is a good clone. It is\nfantastic for maintaining lots of passwords. It encourages me to\nhave tough passwords--usually a random string of characters.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-adium.png\"/>\n<strong><a target=\"_blank\" href=\"http://adium.im\">Adium</a>\n(Free).</strong> Adium is a great client that integrates IM and\nIRC. I used Pidgin on Windows because I was too lazy to find\nsomething else. It's IRC support was lacking and the program is a\nlittle buggy in general. Adium has treated me well and has a nice\nGUI for OSX.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-transmit.png\"/>\n<strong><a target=\"_blank\" href=\"https://www.panic.com/transmit/buy.html\">Transmit</a>\n($34).</strong> I relied on WinSCP for quickly managing remote\nfiles. Transmit is a good replacement.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-sublime-text-2.png\"/>\n<strong><a target=\"_blank\" href=\"http://www.sublimetext.com\">Sublime Text</a> ($59).</strong>\nInstead of Notepad++ I use Sublime Text. It is a powerful but\nsimple text editor with a tabbed interface. I use it for files I\nwant to look at real quick, for text files, and for editing files\nopened in Transmit.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-mamp.png\"/>\n<strong><a target=\"_blank\" href=\"http://www.mamp.info/en/downloads/index.html\">MAMP</a>\n(Free).</strong> The free version of MAMP is doesn't do much, but\nwhen you install it, you get a working version of Apache, MySQL,\nand PHP. Unlike MAMP Pro, you have to make some changes to\nhttpd.conf and php.ini to get started. For example, by default\n.htaccess files are not parsed and Apache runs on port 8888 instead\nof 80. MAMP/MAMP Pro are actually very disappointing! I'm used to\nWAMP on Windows which is very full featured. I know I could easily\ninstall Apache, MySQL and PHP with brew or by hand, but as a\ndeveloper, I'd rather spend zero time doing sysadmin. Maybe I'm\njust lazy.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-regexhibit.png\"/>\n<strong><a target=\"_blank\" href=\"http://homepage.mac.com/roger_jolly/software/\">RegExhibit</a>\n(Free).</strong> I used a Windows-only program called Regex Buddy.\nRegExhibit isn't nearly as cool, but it is a nice little Regex\ntester.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-iterm2.png\"/>\n<strong><a target=\"_blank\" href=\"http://www.iterm2.com/\">iTerm\n2</a> (Free).</strong> The OSX Terminal is boring. iTerm 2\nrocks.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-sequel-pro.png\"/>\n<strong><a target=\"_blank\" href=\"http://www.sequelpro.com/download/\">Sequel Pro</a>\n(Free).</strong> I am in love with Sequel Pro! I have tried dozens\nof desktop SQL clients for Windows. I stuck with phpMyAdmin mostly\nbecause it fit my developer workflow so easily. Sequel Pro has\nalmost all the same workflows and is a fantastic SQL client. My\nonly complaint is that there is not a quick way to export data\nexcept to a file. It is nice to quickly generate a string for copy\nand paste.</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-app-cleaner.png\"/>\n<strong><a target=\"_blank\" href=\"http://www.macupdate.com/app/mac/25276/appcleaner\">AppCleaner</a>\n(Free).</strong> One of my pet peaves on OSX is the methodology for\ninstalling and uninstalling apps. When you click on a dmg you often\nget an unintuitive screen that requires you to drag an icon into a\nfolder. Often there is no install wizard. No indication that\ninstall succeeded. Now granted most OSX apps don't actually install\nanything, but I still find it weird. Even weirder is uninstalling.\nPutting an app in the trash is uninstalling? Very strange. And of\ncourse the most annoying part is that moving an app to the trash\nleaves behind data and configuration files. With AppCleaner, you\ndrag app icons to the AppCleaner window instead of the trash. It\nfinds supporting files and deletes those as well. But I still don't\nfeel good about my uninstall until I empty the trash :)</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-display-maid.png\"/>\n<strong><a target=\"_blank\" href=\"http://itunes.apple.com/us/app/display-maid/id450063525?mt=12\">Display\nMaid</a> ($5).</strong> There is a huge usuability problem in OSX\nwhen switching from one monitor to another. If you switch from a\nsmall screen to a larger one, the maximized windows won't be\nmaximized any longer. If you switch from a large screen to a\nsmaller one, many of the windows will be off the screen. Seriously,\nwhat the heck? With Display Maid, you get your windows situated on\none display and click \"Save Workspace.\" Now every time you switch\nto that display, your windows will be moved and resized to their\nsaved positions. Rock On!</li>\n<li><img class=\"app-icon\" height=\"100\" width=\"100\" alt=\"logo\" src=\"/sites/all/themes/kds2/img/posts/osx/100-color-snapper.png\"/>\n<strong><a target=\"_blank\" href=\"http://itunes.apple.com/us/app/colorsnapper/id418176775?mt=12\">ColorSnapper</a>\n($5).</strong> Seriously. Color pickers on windows are a dime a\ndozen. Some of the color pickers on OSX don't have hex notation.\nUseless for web design! ColorSnapper is a nice little color picker.\nIt boasts itself to be the \"missing color picker for OSX.\" Pretty\naccurate actually.</li>\n</ul>\n<p>I'd also like to list the things I like and my gripes.</p>\n<h2>Things I Like</h2>\n<ul>\n<li><strong>Awesome hardware.</strong> My Macbook Pro is seriously\nfast. I got an SSD which seems like a big part of it.\nUnfortunately, I only got 4GB of ram which is apparently not\nenough: I'm using a lot of SWAP. I've ordered 8GB from NewEgg to\nreplace myself for $42. The processor is almost always idle and the\ngraphics never have lag.</li>\n<li><strong>Fast wakeup.</strong> Waking up my Mac takes less than\n2 seconds. Very cool! Only bad part is that my Macbook has frozen 4\ntimes while sleeping. I had no choice but to hold down the power\nbutton for 5 seconds then power back up. But OSX is pretty good\nabout opening all the apps you just had open.</li>\n</ul>\n<h2>Gripes</h2>\n<ul>\n<li><strong>Software costs money.</strong> Something you have to\nexpect with OSX. But I did expect OSX apps to be superior to free\nWindows apps of comparable functionality. I found that to be\nuntrue. Windows has a huge number of very good free apps.</li>\n<li><strong>Thunderbolt Monitor heat.</strong> This is so weird to\nme--there are not enough heat vents on the 27\" Thunderbolt monitor.\nMost of the heat pours out through the speakers on the bottom. So I\nend up with a hot desk and keyboard.</li>\n<li><strong>Macbook Pro key spacing.</strong> When a Macbook Pro\nlid is closed, apparently there is so little space between the\nscreen and keys that oil and smudges transfer from the keys to the\nscreen. After only a week, my screen is covered in key-shaped\ncrap.</li>\n<li><strong>Finder is worthless.</strong> There is no place to copy\nand paste a window location. That is really handy for save dialogs\nfor example. When an image file is selected, sometimes its\ndimensions will suddenly disappear. Sometimes it comes back and\nsometimes you have to open it to find out how big it is. I'm going\nto look into installing a Finder replacement.</li>\n<li><strong>Window switching</strong> There is no visual way to\nswitch between two windows of the same app. If the windows are on\ntop of each other, you can either go to Mission Control or right\nclick and choose the window by title.</li>\n<li><strong>Color settings.</strong> When I connect my mac to my\nhome Samsung monitor via VGA the gamma is way off. The display was\nvery washed out. I went through the OSX color callibrator and it\nmade it better but not nearly 100%. Very strange.</li>\n<li><strong>Poor laptop speakers.</strong> The speakers don't go\nvery loud and distort quickly. And in clamshel mode they are under\nthe screen so it is even worse sound.</li>\n<li><strong>Font antialiasing.</strong> I agree that in general OSX\nfont aliasing looks really good. My only problem is that it is\noften hard to distinguish bold from normal text--especially on\nsmall sans-serif fonts.</li>\n<li><strong>Flash drive mounting.</strong> Flash drives are slow to\nmount and complain when you remove them without clicking the eject\nbutton. Lame.</li>\n<li><strong>Headphone switching lag.</strong> When plugging in or\nunplugging headphones, the sound takes 2 to 5 seconds to switch to\nheadphones and back to speakers. Every other computer I've ever\nused switches instantly.</li>\n<li><strong>Home and end keys.</strong> Apple + Right and Apple +\nLeft do make sense, but the Home and End keys should operate like\non Windows 7 and Linux. I have fought it by installing plugins on\nFirefox and Thunderbird and changing the system setting for\nkeymapping to make home go to the beginning of the line and end to\nthe end.</li>\n</ul>\n<h2>Would I do it again?</h2>\n<p>It's a toss up. If I had to pay for my own software next time, I\nthink I would choose Windows. Overall, Mac hardware makes up for\nmost of my gripes. I am happy with the switch, but I don't know if\nI would do it again.</p>",
    "timestamp": 1328598000000,
    "slug": "i-switched-from-windows-7-to-os-x-lion",
    "nid": 100
}