{
    "comments": [],
    "tags": ["html", "technology", "web-dev"],
    "title": "You Are Using SPDY and Don't Even Know It",
    "html": "<p><a target=\"_blank\" href=\"http://www.igvita.com/2011/04/07/life-beyond-http-11-googles-spdy/\">\nigvita.com</a> explains what SPDY is, how it works and where it is\nused. As you may remember, Google proposed an add-on to HTTP that\nwas faster because of multiplexing, server pushing and better\ncompression including compression of headers and the use of a\npre-defined dictionary.</p>\n<p>I heard about SPDY when Google announced it in 2009 but hadn't\nheard much since. For all I knew it was something that never took\noff like <a target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Go_%28programming_language%29\">Google\nGo</a>. But it turns out that Google has been serving pages in SPDY\nto Chrome for several months now. As you use Chrome you may notice\nthat unlike other browsers chrome does not display \"http://\" at the\nbeginning of the location bar. Part of the reason is because Gmail,\nGoogle Docs and other Google services are actually running on\n\"spdy://\". So you don't even know it: you are using SPDY.</p>\n<p>There is a <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=spdy\" target=\"_blank\">ticket filed for Firefox</a> but it doesn't look like SPDY\nwill be implemented anytime soon. I couldn't find anything about\nplans for SPDY for Safari or Internet Explorer.</p>\n<p><strong>UPDATE (2 April 2012):</strong> Firefox 11 implements\nSPDY as an option (search for \"spdy\" on about:config), and\naccording to <a href=\"http://forums.mozillazine.org/viewtopic.php?f=48&amp;t=2441603\">this\nMazillazine thread</a>, Firefox 13 will enable SPDY by default.\nThat thread also mentions an add-on that shows an icon when a site\nis using SPDY (Search for \"spdy\" on <a href=\"http://addons.mozilla.org\">addons.mozilla.org</a>).</p>",
    "timestamp": 1312869600000,
    "slug": "you-are-using-spdy-and-dont-even-know-it",
    "nid": 82
}